# Arbol de desición
+ Aprendizaje supervisado.
+ Ampliamente extendido.
+ Diferentes algoritmos derivan de los árboles de decisión.
+ Primeras versiones por Leo Breiman.
+ Utilizados para clasificación y regresión
+ Aprenden de los datos generando reglas de tipo if-else.
+ Divisiones conocidas como nodos.
+ Cuando un nodo no conduce a nuevas divisiones, se le denomina hoja.
## Ejemplo
!['ejemplo_arbol.png'](./img/ej_arbol_desicion.png)

In [4]:
# importar librerias
import pandas as pd
import matplotlib.pyplot as plt

In [5]:
# cargar el dataset
df_titanic = pd.read_csv('./data/titanic.csv', sep=',')

## Exploración de datos

In [6]:
# visualización del Dataframe
df_titanic.head(10)

,Survived,Pclass,Name,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
0,0,3,Mr. Owen Harris Braund,male,22.0,1,0,7.2500
1,1,1,Mrs. John Bradley (Florence Briggs Thayer) Cum...,female,38.0,1,0,71.2833
2,1,3,Miss. Laina Heikkinen,female,26.0,0,0,7.9250
3,1,1,Mrs. Jacques Heath (Lily May Peel) Futrelle,female,35.0,1,0,53.1000
4,0,3,Mr. William Henry Allen,male,35.0,0,0,8.0500
5,0,3,Mr. James Moran,male,27.0,0,0,8.4583
6,0,1,Mr. Timothy J McCarthy,male,54.0,0,0,51.8625
7,0,3,Master. Gosta Leonard Palsson,male,2.0,3,1,21.0750
8,1,3,Mrs. Oscar W (Elisabeth Vilhelmina Berg) Johnson,female,27.0,0,2,11.1333
9,1,2,Mrs. Nicholas (Adele Achem) Nasser,female,14.0,1,0,30.0708

In [7]:
# Eliminar columnas no importantes para el modelo
columns_to_drop = ['Name', 'Fare']
df_titanic.drop(columns_to_drop, axis=1, inplace=True)

In [9]:
# Renombrar las columnas
df_titanic.columns = ['Survived', 'Pclass', 'Sex', 'Age', 'SibSp', 'Parch']
df_titanic.head()

   Survived  Pclass     Sex   Age  SibSp  Parch
0         0       3    male  22.0      1      0
1         1       1  female  38.0      1      0
2         1       3  female  26.0      0      0
3         1       1  female  35.0      1      0
4         0       3    male  35.0      0      0

In [10]:
# analizar el shape del objeto
df_titanic.shape

(887, 6)

In [11]:
# Visualizar los tipos de datos
df_titanic.dtypes

Survived      int64
Pclass        int64
Sex          object
Age         float64
SibSp         int64
Parch         int64
dtype: object

In [12]:
# cambiamos los tipos de datos
df_titanic =  pd.get_dummies(df_titanic, columns= ['Sex'], drop_first= True)
df_titanic.dtypes

Survived      int64
Pclass        int64
Age         float64
SibSp         int64
Parch         int64
Sex_male      uint8
dtype: object

In [13]:
df_titanic.head()

   Survived  Pclass   Age  SibSp  Parch  Sex_male
0         0       3  22.0      1      0         1
1         1       1  38.0      1      0         0
2         1       3  26.0      0      0         0
3         1       1  35.0      1      0         0
4         0       3  35.0      0      0         1

In [14]:
# renombrar el campo Sex
df_titanic.rename(columns={'Sex_male': 'Sex'}, inplace=True)

In [15]:
#Ordenar columnas por nombre
df_titanic = df_titanic[['Survived', 'Pclass', 'Sex', 'Age', 'SibSp', 'Parch']]
df_titanic.head()

   Survived  Pclass  Sex   Age  SibSp  Parch
0         0       3    1  22.0      1      0
1         1       1    0  38.0      1      0
2         1       3    0  26.0      0      0
3         1       1    0  35.0      1      0
4         0       3    1  35.0      0      0